yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

/* Draw lip keypoints: convert relative (0-1) to absolute using face bbox. */
static void DrawLipLandmark(
    const float *smoothedRelX, const float *smoothedRelY,
    int faceX0, int faceY0, int faceW, int faceH,
    image_t *drawImg
)
{
	int lipColor = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int drawX = faceX0 + (int)(smoothedRelX[i] * faceW) + LIP_OFFSET_X;
		int drawY = faceY0 + (int)(smoothedRelY[i] * faceH) + LIP_OFFSET_Y;
		imlib_draw_circle(drawImg, drawX, drawY, 2, lipColor, 1, true);
	}
}

/* Apply EMA in RELATIVE space (0-1 within face bbox). Head movement doesn't affect relative lip position. */
static void ApplyLipSmoothing(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int prevFaceIdx, int faceW, int faceH,
    float *outSmoothedRelX, float *outSmoothedRelY
)
{
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;
        /* Landmark m_x,m_y are in face crop coords (0 to faceW, 0 to faceH). Normalize to 0-1. */
        float rawRelX = (faceW > 0) ? ((float)results_KP[idx].m_x / (float)faceW) : 0.0f;
        float rawRelY = (faceH > 0) ? ((float)results_KP[idx].m_y / (float)faceH) : 0.0f;
        if (prevFaceIdx >= 0 && prevFaceIdx < MAX_TRACKED_FACES && s_asPrevLipState[prevFaceIdx].valid) {
            outSmoothedRelX[i] = LANDMARK_SMOOTHING_ALPHA * rawRelX + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipX[i];
            outSmoothedRelY[i] = LANDMARK_SMOOTHING_ALPHA * rawRelY + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipY[i];
        } else {
            outSmoothedRelX[i] = rawRelX;
            outSmoothedRelY[i] = rawRelY;
        }
    }
}

/* MAR: vertical/horizontal extent of lip bbox + chin. Lip-relative. */
static float ComputeMAR(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    const float *smoothedRelX, const float *smoothedRelY,
    int faceW, int faceH
)
{
    if (results_KP.size() < 468) return 0.0f;
    float minX = 1e9f, maxX = -1e9f, minY = 1e9f, maxY = -1e9f;
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        if (smoothedRelX[i] < minX) minX = smoothedRelX[i];  if (smoothedRelX[i] > maxX) maxX = smoothedRelX[i];
        if (smoothedRelY[i] < minY) minY = smoothedRelY[i];  if (smoothedRelY[i] > maxY) maxY = smoothedRelY[i];
    }
    if (MAR_CHIN_INDEX < (int)results_KP.size() && faceW > 0 && faceH > 0) {
        float cx = (float)results_KP[MAR_CHIN_INDEX].m_x / (float)faceW;
        float cy = (float)results_KP[MAR_CHIN_INDEX].m_y / (float)faceH;
        if (cx < minX) minX = cx;  if (cx > maxX) maxX = cx;
        if (cy < minY) minY = cy;  if (cy > maxY) maxY = cy;
    }
    float horiz = maxX - minX;
    float vert = maxY - minY;
    if (horiz < 0.02f) return 0.0f;
    return vert / horiz;
}

/* MAR velocity from smoothed MAR. */
static float ComputeMARVelocityAndSmooth(float rawMAR, int trackId, float *outSmoothedMAR)
{
    float smoothed = rawMAR;
    float velocity = 0.0f;
    if (trackId >= 0 && trackId < MAX_TRACKED_FACES && s_asPrevLipState[trackId].valid) {
        float prev = s_asPrevLipState[trackId].prevMAR;
        smoothed = MAR_SMOOTHING_ALPHA * rawMAR + (1.0f - MAR_SMOOTHING_ALPHA) * prev;
        if (s_asPrevLipState[trackId].prevPrevValid) {
            float old = s_asPrevLipState[trackId].prevPrevMAR;
            velocity = (smoothed > old) ? (smoothed - old) : (old - smoothed);
        } else {
            velocity = (smoothed > prev) ? (smoothed - prev) : (prev - smoothed);
        }
    }
    *outSmoothedMAR = smoothed;
    return velocity;
}

/* Find best-matching previous face by bbox center distance (for face order changes) */
static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) continue;
        int prevCx = s_asPrevLipState[j].x0 + s_asPrevLipState[j].w / 2;
        int prevCy = s_asPrevLipState[j].y0 + s_asPrevLipState[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx*dx + dy*dy);
        if (dist < bestDist && dist < (float)(curW + curH)) {  /* Allow face to move within ~2x face size */
            bestDist = dist;
            bestIdx = j;
        }
    }
    return bestIdx;
}

