yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
/* Allocate new track when no match. Use first invalid slot. */
static int AllocateTrack(int faceIdx)
{
    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) return j;
    }
    return faceIdx % MAX_TRACKED_FACES;  /* Fallback: evict by face index */
}

/* Compute normalized bbox center movement. Returns sqrt(dx^2+dy^2) in units of bbox size. */
static float HeadMoveAmount(int trackId, int curX0, int curY0, int curW, int curH)
{
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES || !s_asPrevLipState[trackId].valid || curW <= 0 || curH <= 0)
        return 0.0f;
    int prevCx = s_asPrevLipState[trackId].x0 + s_asPrevLipState[trackId].w / 2;
    int prevCy = s_asPrevLipState[trackId].y0 + s_asPrevLipState[trackId].h / 2;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;
    float dx = (float)(curCx - prevCx) / (float)curW;
    float dy = (float)(curCy - prevCy) / (float)curH;
    return std::sqrt(dx*dx + dy*dy);
}

/* Store smoothed lip positions, MAR, and bbox. */
static void StoreLipState(
    const float *smoothedRelX, const float *smoothedRelY, float smoothedMAR,
    int storeIdx, int faceX0, int faceY0, int faceW, int faceH
)
{
    if (storeIdx >= MAX_TRACKED_FACES || storeIdx < 0) return;
    S_PREV_LIP_STATE *s = &s_asPrevLipState[storeIdx];
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        s->lipX[i] = smoothedRelX[i];
        s->lipY[i] = smoothedRelY[i];
    }
    s->prevPrevMAR = s->prevMAR;
    s->prevPrevValid = s->valid;
    s->prevMAR = smoothedMAR;
    s->x0 = faceX0;
    s->y0 = faceY0;
    s->w = faceW;
    s->h = faceH;
    if (s->valid) {
        float a = BBOX_SMOOTHING_ALPHA;
        s->smoothX0 = (int)(a * faceX0 + (1.0f - a) * s->smoothX0);
        s->smoothY0 = (int)(a * faceY0 + (1.0f - a) * s->smoothY0);
        s->smoothW  = (int)(a * faceW  + (1.0f - a) * s->smoothW);
        s->smoothH  = (int)(a * faceH  + (1.0f - a) * s->smoothH);
    } else {
        s->smoothX0 = faceX0;
        s->smoothY0 = faceY0;
        s->smoothW  = faceW;
        s->smoothH  = faceH;
    }
    s->valid = 1;
}

static void DrawDetectFace(
    std::vector<arm::app::face_detection::DetectionResult> &results,
    std::vector<bool> &isSpeaking,
    image_t *drawImg
)
{
	arm::app::face_detection::DetectionResult faceBox;
	int faceBoxSize = results.size();
	
	for(int i = 0; i < faceBoxSize; i ++)
	{
		faceBox = results[i];
		/* Green when speaking, blue otherwise */
		int boxColor = (i < (int)isSpeaking.size() && isSpeaking[i])
			? COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0)  /* Green */
			: COLOR_B5_MAX;  /* Blue */
		imlib_draw_rectangle(drawImg, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, boxColor, 2, false);
		/* Draw "Speaking" label when speaking */
		if (i < (int)isSpeaking.size() && isSpeaking[i]) {
			imlib_draw_string(drawImg, faceBox.m_x0, faceBox.m_y0 - 14, "Speaking", COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, 0, 0, false, 0, false, false, 0, false, false);
		}
	}
}

static void DetectFaceRegion(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceDetectionModel *faceDetectionModel,	
	arm::app::FaceDetectorPostProcess *postProcess,
	arm::app::Profiler *profiler
)
{
    TfLiteIntArray *inputShape = faceDetectionModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceDetectionModel->GetInputTensor(0);
    rectangle_t roi;

    const int inputImgCols = inputShape->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);
	
	//resize full image to input tensor
	image_t resizeImg;

	roi.x = 0;
	roi.y = 0;
	roi.w = infFramebuf->frameImage.w;
	roi.h = infFramebuf->frameImage.h;

	resizeImg.w = inputImgCols;
	resizeImg.h = inputImgRows;
	resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
	resizeImg.pixfmt = PIXFORMAT_GRAYSCALE;

	if(profiler)
		u64StartCycle = pmu_get_systick_Count();

	imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect resize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
		
    /* Original quant: pixel-128. Model was trained with this. */
	for (size_t i = 0; i < inputTensor->bytes; i++)
	{
		signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
	}

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		profiler->StartProfiling("Inference");
	}

	faceDetectionModel->RunInference();

	if(profiler){
		profiler->StopProfiling();
		profiler->PrintProfilingResult();
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
	
	postProcess->RunPostProcess(infFramebuf->results_FD);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	float scaleFactoryW = 1.4;
	float scaleFactoryH = 1.4;
	arm::app::face_detection::DetectionResult *faceBox;
	//fine tune face region
	for(int i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		float scaleW;
		float scaleH;
		int newX;
		int newY;
		
		int newW;
		int newH;

		faceBox = &(infFramebuf->results_FD[i]);
	
		scaleH = scaleFactoryH * faceBox->m_h;
//		scaleW = scaleFactoryW * faceBox->m_w;
		scaleW = scaleH;
		newW = scaleW;
		newH = scaleH;

		newX = faceBox->m_x0 - ((scaleW - faceBox->m_w) / 2);
		newY = faceBox->m_y0 - ((scaleH - faceBox->m_h) / 2);
		
		if(newX < 0)
			newX = 0;
		
		if(newY < 0)
			newY = 0;

		if(newX + newW >= infFramebuf->frameImage.w)
			newW = infFramebuf->frameImage.w - newX;
		
		if(newY + newH >= infFramebuf->frameImage.h)
			newH = infFramebuf->frameImage.h - newY;

