yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
		faceBox->m_x0 = newX;
		faceBox->m_y0 = newY;
		faceBox->m_w = newW;
		faceBox->m_h = newH;
	}
}

static void DetectFaceLandmark_DrawResult(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceLandmarkModel *faceLandmarkModel,	
	arm::app::face_landmark::FaceLandmarkPostProcessing *postProcess,
	arm::app::Profiler *profiler
)
{
	int i;
	arm::app::face_detection::DetectionResult faceBox;
    rectangle_t roi;
    TfLiteIntArray *inputShape = faceLandmarkModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceLandmarkModel->GetInputTensor(0);

    const int inputImgCols = inputShape->data[arm::app::FaceLandmarkModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceLandmarkModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	//Quantize input tensor data
	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);

	TfLiteTensor *modelOutput0 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_MESH_TENSOR_INDEX);

	#if defined(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput1 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX);
	#else
		TfLiteTensor *modelOutput1 = NULL;
	#endif

	#if defined(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput2 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX);			
	#else
		TfLiteTensor *modelOutput2 = NULL;
	#endif

	TfLiteTensor *modelOutput3 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_FACE_FLAG_TENSOR_INDEX);

	/* Resize speaking state to match face count */
	infFramebuf->isSpeaking.resize(infFramebuf->results_FD.size(), false);

	/* Frame skip: only run speaking detection every N frames - reduces jitter-induced false triggers */
	s_u32SpeakingDetectFrameCount++;
	const int runDetectionThisFrame = (s_u32SpeakingDetectFrameCount % SPEAKING_DETECT_EVERY_N_FRAMES) == 0;
	
	for(i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		faceBox = infFramebuf->results_FD[i];

		/* Stable trackId: use for all state. Fixes flicker when face order changes. */
		int matchedPrev = FindMatchingPrevFace(faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
		if (matchedPrev < 0 && infFramebuf->results_FD.size() == 1) {
			matchedPrev = (s_asPrevLipState[0].valid) ? 0 : -1;
		}
		int trackId = (matchedPrev >= 0) ? matchedPrev : AllocateTrack(i);
		if (matchedPrev < 0 && trackId < MAX_TRACKED_FACES) {
			s_abSpeaking[trackId] = false;
			s_i32SpeakingConfirmCount[trackId] = 0;
			s_i32SpeakingReleaseCount[trackId] = 0;
			s_i32SpeakingDurationCount[trackId] = 0;
		}

		/* Raw face bbox for crop - no padding. */
		roi.x = faceBox.m_x0;
		roi.y = faceBox.m_y0;
		roi.w = faceBox.m_w;
		roi.h = faceBox.m_h;

		//resize face region image to input tensor
		image_t resizeImg;

		resizeImg.w = inputImgCols;
		resizeImg.h = inputImgRows;
		resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
		resizeImg.pixfmt = PIXFORMAT_RGB888;

		if(profiler)
			u64StartCycle = pmu_get_systick_Count();

        imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark resize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}
			
		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}
			
		/* Original quant: pixel-128. Model was trained with this. */
		for (size_t i = 0; i < inputTensor->bytes; i++)
		{
			signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
		}

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		if(profiler){
			profiler->StartProfiling("Inference");
		}

		faceLandmarkModel->RunInference();

		if(profiler){
			profiler->StopProfiling();
			profiler->PrintProfilingResult();
		}

		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}

		postProcess->RunPostProcessing(
			inputImgCols,
			inputImgRows,
			roi.w,
			roi.h,
			modelOutput0,
			modelOutput1,
			modelOutput2,
			modelOutput3,
			infFramebuf->results_KP);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		/* Always: smoothing + drawing. Detection + store only every N frames. */
		if (trackId < MAX_TRACKED_FACES && infFramebuf->results_KP.size() >= 468) {
			ApplyLipSmoothing(infFramebuf->results_KP, trackId, roi.w, roi.h, s_afSmoothedRelX, s_afSmoothedRelY);

			if (runDetectionThisFrame) {
				/* Simple MAR + MAR velocity */
				float rawMAR = ComputeMAR(infFramebuf->results_KP, s_afSmoothedRelX, s_afSmoothedRelY, roi.w, roi.h);
				float smoothedMAR;
				float marVelocity = ComputeMARVelocityAndSmooth(rawMAR, trackId, &smoothedMAR) / (float)SPEAKING_DETECT_EVERY_N_FRAMES;

				float headMove = HeadMoveAmount(trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
				int headMoving = (headMove > HEAD_MOVE_THRESHOLD);

				int signalAboveOn  = !headMoving && (marVelocity > SPEAKING_MAR_VELOCITY_THRESHOLD_ON) && (smoothedMAR > SPEAKING_MAR_THRESHOLD_ON);
				int signalBelowOff = (marVelocity < SPEAKING_MAR_VELOCITY_THRESHOLD_OFF) || (smoothedMAR < SPEAKING_MAR_THRESHOLD_OFF);

				/* All state indexed by trackId - fixes flicker when face order changes */
				if (signalAboveOn) {
					s_i32SpeakingConfirmCount[trackId] = (s_i32SpeakingConfirmCount[trackId] < SPEAKING_SMOOTHING_FRAMES) ? s_i32SpeakingConfirmCount[trackId] + 1 : SPEAKING_SMOOTHING_FRAMES;
					s_i32SpeakingReleaseCount[trackId] = 0;
					if (s_i32SpeakingConfirmCount[trackId] >= SPEAKING_SMOOTHING_FRAMES) {
						s_abSpeaking[trackId] = true;
					}
				} else if (s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId]++;
					if (signalBelowOff) {
						s_i32SpeakingReleaseCount[trackId]++;
						if (s_i32SpeakingReleaseCount[trackId] >= SPEAKING_RELEASE_FRAMES &&
							s_i32SpeakingDurationCount[trackId] >= SPEAKING_MIN_DURATION_FRAMES) {
							s_abSpeaking[trackId] = false;
						}
					} else {
						s_i32SpeakingReleaseCount[trackId] = 0;
					}
					s_i32SpeakingConfirmCount[trackId] = 0;
				} else {
					s_i32SpeakingReleaseCount[trackId] = 0;
					s_i32SpeakingConfirmCount[trackId] = 0;
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				if (!s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				/* Map trackId -> face index for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
				StoreLipState(s_afSmoothedRelX, s_afSmoothedRelY, smoothedMAR, trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
			} else {
				/* Not a detection frame - still need to map trackId to face for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
			}
		} else if (trackId < MAX_TRACKED_FACES) {
			s_asPrevLipState[trackId].valid = 0;
		}

		//Draw lip landmarks (relative to face bbox)
		if(infFramebuf->results_KP.size() >= 468)
		{
			if(profiler){
				u64StartCycle = pmu_get_systick_Count();
			}
			DrawLipLandmark(s_afSmoothedRelX, s_afSmoothedRelY, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, &infFramebuf->frameImage);

			if(profiler){
				u64EndCycle = pmu_get_systick_Count();
				info("draw face landmark cycles %llu \n", (u64EndCycle - u64StartCycle));
			}
		}
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}

	DrawDetectFace(infFramebuf->results_FD, infFramebuf->isSpeaking, &infFramebuf->frameImage);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("draw face region cycles %llu \n", (u64EndCycle - u64StartCycle));
	}
}

static int32_t PrepareModelToHyperRAM(void)
{
#define MODEL_FILE "0:\\face_landmark.tflite"
#define EACH_READ_SIZE 512
	
    TCHAR sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */	
    f_chdrive(sd_path);          /* set default path */

	int32_t i32FileSize;
	int32_t i32FileReadIndex = 0;
	int32_t i32Read;
	
	if(!ModelFileReader_Initialize(MODEL_FILE))
	{
        printf_err("Unable open model %s\n", MODEL_FILE);		
		return -1;
	}
	
	i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		i32FileReadIndex += i32Read;
	}
	
